EDT/УТ/src/Documents/новаПретензияПеревозчику/новаПретензияПеревозчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>новаПретензияПеревозчику</name>
  <registerRecords>AccumulationRegister.новаРейтингПеревозчиков</registerRecords>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПретензии</name>
    <type>
      <types>CatalogRef.новаВидыПретензийПеревозчикам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрафныеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/новаРейтингПеревозчиков/новаРейтингПеревозчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>новаРейтингПеревозчиков</name>
  <resources>
    <name>НачисленныеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрафныеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВидПретензии</name>
    <type>
      <types>CatalogRef.новаВидыПретензийПеревозчикам</types>
    </type>
  </attributes>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/новаПретензияПеревозчику/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движение = Движения.новаРейтингПеревозчиков.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Водитель = Водитель;
	Движение.Контрагент = Контрагент;
	Движение.ШтрафныеБаллы = ШтрафныеБаллы;
	Движение.ВидПретензии = ВидПретензии;
КонецПроцедуры
